function dt()
{
    let data = [[["сентябрь", 29, "Тест", "./Test01/", 8, 11]],
                [
                 ["Абдулаева А.", 8],
                 ["Агеева А.", 7],
                 ["Альшов В.", 12],
                 ["Атантаев", 9],
                 ["Баранов Сергей", 10],
                 ["Бакарева Алина", 9],
                 ["Белов Антон", 8],
                 ["Белогуров Кирилл", 11],
                 ["Былков", 8],
                 ["Воробьёв", 10],
                 ["Воронов", 9],
                 ["Гафаров", 8],
                 ["Ганчев", 9],
                 ["Галкин", 11],
                 ["Гильмурахманов", 10],
                 ["Горбатенко", 9],
                 ["Григорьев Г.", 11],
                 ["Громов", 7],
                 ["Грязнов Никита", 9],
                 ["Голованов Роман", 9],
                 ["Демин А.С.", 9],
                 ["Джафаров Артур", 9],
                 ["Дубов", 10],
                 ["Дорошин Никита", 8],
                 ["Дыров? Георгий", 7],
                 ["Егоров Никита", 12],
                 ["Емилев?", 9],
                 ["Енифанцев?", 12],
                 ["Жекеров", 7],
                 ["Загренов А.", 7],
                 ["Зайцев Кирилл", 10],
                 ["Золотарев", 8],
                 ["Иванова Алина", 10],
                 ["Илларионова", 8],
                 ["Капунников Артём", 9],
                 ["Калюта Клименттит???", 9],
                 ["Карпенко Владимир", 9],
                 ["Карпов Даниил", 9],
                 ["Карпов Артём", 10],
                 ["Ковалев", 10],
                 ["Коваленко Маша", 10],
                 ["Колонов И.С.", 10],
                 ["Кочерьян А.В.", 12],
                 ["Кубышкин Степан", 8],
                 ["Кузьмин Н.", 4],
                 ["Куркин Алексей", 10],
                 ["Ламотько А.", 11],
                 ["Ляляев А.", 10],
                 ["Магомедов Г.А.", 9],
                 ["Манчеко М.Д.", 12],
                 ["Маштак А.В.", 6],
                 ["Мельников", 10],
                 ["Меняйлов", 6],
                 ["Михайлов М.", 8],
                 ["Мирзобаев", 9],
                 ["Моисеев", 10],
                 ["Молла-Мурадов Д.", 10],
                 ["Монахин С.Д.", 8],
                 ["Мусын Д.", 11],
                 ["Набанов? В.М.", 8],
                 ["Навопецкая Ю.", 10],
                 ["Наталин? Т.", 12],
                 ["Нестеренко В.", 10],
                 ["Николаев И.", 10],
                 ["Новиков Д.Н.", 8],
                 ["Носов А.М.", 6],
                 ["Осинин Артём", 9],
                 ["Панковский М.", 9],
                 ["Пашневич Матвей", 9],
                 ["Перхов Игорь", 9],
                 ["Петухова Д.", 11],
                 ["Покатилов А.", 10],
                 ["Приоров В.", 10],
                 ["Пугачев Н.", 9],
                 ["Рачманина? Н.", 11],
                 ["Рязанцева А.", 10],
                 ["Сатиев Т", 10],
                 ["Семенюк", 7],
                 ["Скибицкий М.Е.", 12],
                 ["Сковалин? Н.И.", 9],
                 ["Сколота В.", 8],
                 ["Скопцова Кристина", 9],
                 ["Скринов? А.О.", 11],
                 ["Смирнов Р", 8],
                 ["Соколов Л.", 7],
                 ["Сурков Е", 12],
                 ["Суханов С", 10],
                 ["Табак А.", 9],
                 ["Тажибоев Д.", 10],
                 ["Темненкова Л.В.", 10],
                 ["Тихомирова Ю.", 9],
                 ["Томилов Я.Д.", 12],
                 ["Третьяков А.", 8],
                 ["Трофимов Н.", 6],
                 ["Уперов Н. С.", 6],
                 ["Фокин В.", 7],
                 ["Харлан Ян", 9],
                 ["Хотеннов?", 10],
                 ["Чернецкий", 9],
                 ["Чистяков", 11],
                 ["Цинаридзе Д.", 12],
                 ["Шишков М.", 9],
                 ["Шорников И.", 10],
                 ["Юсупов ИБ", 9],
                 ]]

    let calendar = Array(data[0].length)
    this.calendar = calendar
    let students = Array(data[1].length)
    this.students = students

    for (let i = 0; i < students.length; i++)
    {
        let marks = Array(data[1][i].length - 1)
        students[i] = {name: data[1][i][0], marks: marks}
    }

    for (let i = 0; i < calendar.length; i++)
    {
        let events = Array((data[0][i].length - 1) / 5)
        calendar[i] = {month: data[0][i][0], events: events}
        event_id = 0
        for (let j = 0; j < events.length; j++)
        {
            let k = j * 3 + 1
            events[j] = {day: data[0][i][k], type: data[0][i][k+1], url: data[0][i][k+2]}
            low_mark = data[0][i][k+3]
            high_mark = data[0][i][k+4]
            for (let sid = 0; sid < students.length; sid++)
            {
                result = data[1][sid][event_id + 1]
                students[sid].marks[event_id] = result >= high_mark ? 5 : result < low_mark ? 3 : 4
            }
            event_id += 1
        }
    }
}
