function dt()
{
    let data = [[["сентябрь", 29, "Тест", "./Test01/", 8, 11]],
                [
                 ["Абдулаева А.Г.", 8],
                 ["Агеева А.А.", 7],
                 ["Альшов В.Р.", 12],
                 ["Атантаев А.М.", 0],
                 ["Баранов С.И.", 10],
                 ["Бахарева А.А.", 9],
                 ["Белов А.А.", 8],
                 ["Белогуров К.М.", 11],
                 ["Бояновский С.Н.", 0],
                 ["Былков Д.А.", 8],
                 ["Варфоломеев К.В.", 0],
                 ["Васина А.А.", 0],
                 ["Веркина К.Ю.", 0],
                 ["Воробьёв А.В.", 10],
                 ["Воронов А.О.", 9],
                 ["Галкин К.А.", 11],
                 ["Ганчев Д.Д.", 9],
                 ["Гафаров Э.А.", 8],
                 ["Гегидзе И..", 0],
                 ["Гильмурахманов Р.А.", 10],
                 ["Глухов А.С.", 0],
                 ["Голованов Роман", 9],
                 ["Горбатенко А.К.", 9],
                 ["Горбачева Д.С.", 0],
                 ["Горенков Е.Т.", 0],
                 ["Григорьев К.Е.", 11],
                 ["Громов И.А.", 7],
                 ["Грязнов Н.Д.", 9],
                 ["Гужель М.А.", 8],
                 ["Демин А.С.", 9],
                 ["Джафаров А..", 9],
                 ["Доронин Н.Г.", 8],
                 ["Дырин Г.А.", 7],
                 ["Егоров Н.Р.", 12],
                 ["Елисеев Н.Е.", 0],
                 ["Епифанцев С.А.", 12],
                 ["Ермаков В.А.", 8],
                 ["Жемеров П.П.", 7],
                 ["Загреков А.М.", 7],
                 ["Зайцев К.В.", 10],
                 ["Задорожный И.А.", 10],
                 ["Золотарев Е.В.", 8],
                 ["Иванова А.С.", 10],
                 ["Илларионова Э.Д.", 8],
                 ["Канунников А.А.", 9],
                 ["Кабанова В.В.", 0],
                 ["Калюта К.В.", 9],
                 ["Карпенко В.М.", 9],
                 ["Карпов А.А.", 10],
                 ["Карпов Д.В.", 9],
                 ["Кобрин М.А.", 0],
                 ["Ковалев А.В.", 10],
                 ["Коваленко М.И.", 10],
                 ["Колонов И.С.", 10],
                 ["Конкин Д.В.", 0],
                 ["Корышева А.В.", 0],
                 ["Кочерьян А.В.", 12],
                 ["Красин Е.Д.", 0],
                 ["Кубышкин С.С.", 8],
                 ["Кузьмин Н.С.", 4],
                 ["Куркин А.П.", 10],
                 ["Ламотько А.А.", 11],
                 ["Ляляев А.А.", 10],
                 ["Магомедов Г.А.", 9],
                 ["Манчеко М.Д.", 12],
                 ["Маштак А.В.", 6],
                 ["Мельников А.Е.", 10],
                 ["Меняйлов В.Н.", 6],
                 ["Михайлов М.И.", 8],
                 ["Мирзобаев Н.М.", 9],
                 ["Моисеев В.А.", 10],
                 ["Молла-Мурадов Д.А.", 10],
                 ["Моняхин С.Д.", 8],
                 ["Морозов М.А.", 0],
                 ["Мусин Д.Р.", 11],
                 ["Наволоцкая Ю.А.", 10],
                 ["Наталин Т.А.", 12],
                 ["Нестеренко В.С.", 10],
                 ["Николаев И.Е.", 10],
                 ["Новиков Д.Н.", 8],
                 ["Носов А.М.", 6],
                 ["Осинин А.Д.", 9],
                 ["Паниковский М.К.", 9],
                 ["Пашкевич М.Э.", 9],
                 ["Перхов И.С.", 9],
                 ["Петраченко Д.М.", 0],
                 ["Петров Р.В.", 0],
                 ["Петухова Д.А.", 11],
                 ["Погорельских К.В.", 0],
                 ["Покотилов А.А.", 10],
                 ["Попов К.Р.", 0],
                 ["Приоров В.И.", 10],
                 ["Пугачев Н.Я.", 9],
                 ["Рахманина А..", 11],
                 ["Рязанцева А.А.", 10],
                 ["Сатиев Т.С.", 10],
                 ["Семенюк И.В.", 7],
                 ["Скибицкий М.Е.", 12],
                 ["Сколота В.А.", 8],
                 ["Сновалкин Н.Н.", 9],
                 ["Скопцова К.А.", 9],
                 ["Скрипник В.А.", 0],
                 ["Скрипов А.О.", 11],
                 ["Смирнов Р.В.", 8],
                 ["Соколов Л.Ю.", 7],
                 ["Сурков Е.О.", 12],
                 ["Суханов С.А.", 10],
                 ["Сыщикова Э.А.", 0],
                 ["Табак А.И.", 9],
                 ["Тажибоев Д.У.", 10],
                 ["Темненкова Л.В.", 10],
                 ["Тикунов А.О.", 0],
                 ["Тихомирова Ю.А.", 9],
                 ["Томилов Я.Д.", 12],
                 ["Травников А.С.", 0],
                 ["Третьяков А.А.", 8],
                 ["Трифонов В.В.", 0],
                 ["Трофимов И.С.", 6],
                 ["Тукан Д.С.", 0],
                 ["Уперов Н.С.", 6],
                 ["Фокин В.А.", 7],
                 ["Харлан Я.В.", 9],
                 ["Хотеенков А.А.", 10],
                 ["Чернецкий Р.Д.", 9],
                 ["Чистяков П.О.", 11],
                 ["Цинаридзе Д.С.", 12],
                 ["Шарапов А.Е.", 0],
                 ["Шишков М.А.", 9],
                 ["Шорников И.А.", 10],
                 ["Шукуров А.Ф.", 0],
                 ["Щигорев К.К.", 0],
                 ["Юрин М.А.", 0],
                 ["Юсупов Б..", 9],
                 ["Ягудин А.Р.", 0],
                 ["?Дубов", 10],
                 ["?Емилев (Елисеев?)", 9],
                 ["?Набанов В.М.", 8],
                ]]

    let calendar = Array(data[0].length)
    this.calendar = calendar
    let students = Array(data[1].length)
    this.students = students

    for (let i = 0; i < students.length; i++)
    {
        let marks = Array(data[1][i].length - 1)
        students[i] = {name: data[1][i][0], marks: marks}
    }

    for (let i = 0; i < calendar.length; i++)
    {
        let events = Array((data[0][i].length - 1) / 5)
        calendar[i] = {month: data[0][i][0], events: events}
        event_id = 0
        for (let j = 0; j < events.length; j++)
        {
            let k = j * 3 + 1
            events[j] = {day: data[0][i][k], type: data[0][i][k+1], url: data[0][i][k+2]}
            low_mark = data[0][i][k+3]
            high_mark = data[0][i][k+4]
            for (let sid = 0; sid < students.length; sid++)
            {
                result = data[1][sid][event_id + 1]
                students[sid].marks[event_id] = result == 0 ? 0 : result >= high_mark ? 5 : result < low_mark ? 3 : 4
            }
            event_id += 1
        }
    }
}
